Revit 2027 API
BuiltInFailures.ConnectorFailures.InvalidConnector Property
 The connector is invalid, the size cannot be determined from the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidConnector { get; }
Public Shared ReadOnly Property InvalidConnector As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidConnector {
	FailureDefinitionId^ get ();
}
static member InvalidConnector : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace